# brew
brew "trash"
brew "vim"
brew "sheldon"
brew "mise"
brew "bat"
brew "fzf"
brew "ghq"
brew "git"
brew "jq"
brew "ripgrep"
brew "tree"
brew "lazygit"
brew "glow"
brew "lf"
brew "eza"
brew "git-delta"
brew "chafa"
brew "poppler"
brew "mdcat"

# cask
cask "1password"
cask "alfred"
cask "docker-desktop"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "alt-tab"
cask "slack"
cask "gcloud-cli"
cask "microsoft-office"
cask "bettertouchtool"
cask "wezterm"
cask "font-moralerspace"
cask "zed"
