# brew
brew "trash"
brew "vim"
brew "sheldon"
brew "mise"
brew "bat"
brew "fzf"
brew "ghq"
brew "git"
brew "jq"
brew "ripgrep"
brew "fd"
brew "lazygit"
brew "glow"
brew "eza"
brew "git-delta"
brew "mdcat"
brew "yazi"
brew "ffmpeg-full" # yazi dependency
brew "sevenzip" # yazi dependency
brew "poppler" # yazi dependency
brew "zoxide" # yazi dependency
brew "resvg" # yazi dependency
brew "imagemagick-full" # yazi dependency

# cask
cask "1password"
cask "alfred"
cask "docker-desktop"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "alt-tab"
cask "slack"
cask "gcloud-cli"
cask "microsoft-office"
cask "bettertouchtool"
cask "wezterm"
cask "font-moralerspace"
cask "zed"
