#==================================================================================================
# コアツール
#==================================================================================================
brew "sheldon"   # シェルプラグインマネージャー
brew "mise"      # ランタイムバージョン管理
brew "fzf"       # ファジーファインダー
brew "git"       # バージョン管理
brew "ghq"       # リポジトリ管理
brew "lazygit"   # Git TUI
brew "git-delta" # Git diff ビューアー
brew "jq"        # JSONプロセッサー
brew "glow"      # Markdownレンダラー
brew "mdcat"     # Markdownレンダラー

#==================================================================================================
# モダンCLI
#==================================================================================================
brew "bat"       # cat
brew "ripgrep"   # grep
brew "fd"        # find
brew "eza"       # ls
brew "dust"      # du
brew "duf"       # df
brew "trash"     # rm
brew "vim"       # vi

#==================================================================================================
# ファイルマネージャー
#==================================================================================================
brew "yazi"            # ターミナルファイルマネージャー
brew "ffmpeg-full"      # yazi dependency
brew "sevenzip"         # yazi dependency
brew "poppler"          # yazi dependency
brew "zoxide"           # yazi dependency
brew "resvg"            # yazi dependency
brew "imagemagick-full" # yazi dependency

#==================================================================================================
# cask
#==================================================================================================
cask "1password"
cask "alfred"
cask "docker-desktop"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "alt-tab"
cask "slack"
cask "gcloud-cli"
cask "microsoft-office"
cask "bettertouchtool"
cask "wezterm"
cask "font-moralerspace"
cask "zed"
